Part6.Client/Client/b149f5e6-021e-4603-a00a-51d8a4193033web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-22T07:42:29.1458359Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f28bd7f2-427a-4f42-ac31-259a8dd947a1}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="2272" ThreadID="13" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-22T16:42:28.9468245+09:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5TXe1Y+McBMvsHtU4KRia8AAAAAeTV5z/bFLkmp38+xmu0Z9Ct2B9EndApApoJ+TnSiKWMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="75dc5cbb-b3db-47a1-8b55-11a1b8fdfa94" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-22T07:42:30.6459217Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{f28bd7f2-427a-4f42-ac31-259a8dd947a1}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="2272" ThreadID="13" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-22T16:42:30.6449216+09:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>591</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Tue, 22 Dec 2020 07:42:30 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="b:FullTimeEmployee" xmlns:a="http://pragimtech.com/2013/07/07/Employee" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/EmployeeService"><a:ID>1</a:ID><a:Name>Mark</a:Name><a:Gender>Mail</a:Gender><a:DateOfBirth>1982-10-10T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><a:City></a:City><b:AnnualSalary>6000</b:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-22T07:42:39.2454136Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{b014a419-f626-4e46-a3ac-76c1af7fa38d}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="2272" ThreadID="13" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-22T16:42:39.2444135+09:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5XXe1Y+McBMvsHtU4KRia8AAAAAeTV5z/bFLkmp38+xmu0Z9Ct2B9EndApApoJ+TnSiKWMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="848aaab3-c6f8-4a12-bc51-adef7137095b" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>4</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-12-22T07:46:17.5909022Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{eddaea89-f0da-4aa8-9b91-b1197930c4c6}" /><Execution ProcessName="WebDev.WebServer40" ProcessID="2272" ThreadID="11" /><Channel/><Computer>AVERATEC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-12-22T16:46:17.5909022+09:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5bXe1Y+McBMvsHtU4KRia8AAAAAeTV5z/bFLkmp38+xmu0Z9Ct2B9EndApApoJ+TnSiKWMACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="4ce6ad70-9102-4d13-a2e4-7e7fbdb1d801" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>4</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>